{
  "listingDate":"2021-11-25",
  "requirements":"Client Engagement, Problem Solving, Leverage Technology, Goal Oriented, Passionate.",
  "pay":0,
  "listingType":"DEMO_SOURCE",
  "applicationReq":"Apply on company website",
  "description":"We’re building a relationship-oriented bank for the modern world. We need talented, passionate professionals who are dedicated to doing what’s right for our clients./n/nAt CIBC, we embrace your strengths and your ambitions, so you are empowered at work. Our team members have what they need to make a meaningful impact and are truly valued for who they are and what they contribute./n/nTo learn more about CIBC, please visit CIBC.com/n/nJob Description/n/nWhat you'll be doing/n/nAs a member of the Personal and Business Banking Team, you’ll work in a fast-paced Banking Center and use your knowledge of financial services products to help clients with their day-to-day banking needs. As a Client Service Representative, whether it’s answering questions, assisting with transactions, or proactively connecting clients with the right team members, you’ll be the first line of support as clients work towards their financial goals. You’re flexible to work our banking centre hours which may include evenings and weekends. To help deliver a great client experience, you’re flexible to work at multiple banking centres within a reasonable travel distance./n/nHow You'll Succeed/nClient engagement - Help clients manage their accounts and products. Focus on the client experience and make interactions meaningful. Connect clients to the right CIBC team members who can help them reach their goals./nProblem solving - Listen, ask questions, and put yourself in the client’s shoes. Act like an owner by taking accountability for client issues, and know when to lean on others to create a better solution together./nLeveraging technology - Become a technology expert. Share your knowledge by introducing clients to our mobile banking applications, helping them to better manage their banking needs./nWho You Are/nYou put our clients first. You engage with purpose to find the right solutions. You go the extra mile, because it’s the right thing to do./nYou’re goal oriented. You’re motivated by accomplishing your goals and delivering your best to make a difference./nYou’re passionate about people. You find meaning in relationships, and surround yourself with a diverse network of partners. You connect with others through respect and authenticity./nYou love to learn. You're passionate about growing your knowledge. You have a strong sense of curiosity./nYou engage with your heart and mind. You care about people and respect different perspectives. You listen to and learn from the experiences of others./nValues matter to you. You bring your real self to work and you live our values - trust, teamwork, and accountability./nWhat CIBC Offers/n/nAt CIBC, your goals are a priority. We start with your strengths and ambitions as an employee and strive to create opportunities to tap into your potential. We aspire to give you a career, rather than just a paycheck./nWe work to recognize you in meaningful, personalized ways including a competitive salary, incentive pay, banking benefits, a health benefits program, defined benefit pension plan, an employee share purchase plan and MomentMakers, our social, points-based recognition program/nOur spaces and technological toolkit will make it simple to bring together great minds to create innovative solutions that make a difference for our clients/nWe cultivate a culture where you can express your ambition through initiatives like Purpose Day; a paid day off dedicated for you to use to invest in your growth and development/nWhat You Need To Know/nCIBC is committed to creating an inclusive environment where all team members and clients feel like they belong. We seek applicants with a wide range of abilities and we provide an accessible candidate experience. If you need accommodation, please contact Mailbox.careers-carrieres@cibc.com/nYou need to be legally eligible to work in Canada at the location(s) specified above and, where applicable, must have a valid work or study permit/nJob Location/n/nToronto-Bay and College/n/nHowever this may change dependent on business need./n/nEmployment Type/n/nRegular/n/nWeekly Hours/n/n15",
  "title":"Client Service Representative [Hourly]-1",
  "uuid":null,
  "qualifications":"",
  "demoSourceID":null,
  "location":"Toronto",
  "crossPlatformDuplicates":[],
  "jobType":"FULL_TIME",
  "jobField": "Customer Service"
}