{"listingDate":"2021-11-25","requirements":"Client Engagement, Problem Solving, Leverage Technology, Goal Oriented, Passionate.","pay":45000,"listingType":"DEMO_SOURCE","applicationReq":"Demo Requirements","description":"THE ROLE/n/nReporting to the Director of Finance and Membership Services, this is an exciting and challenging position for an individual who is organized, detail-oriented, positive, and hardworking. The successful candidate is responsible for the day-to-day administrative duties of this dynamic and exciting association office. The Office Administrator provides the support and coordination of programs, activities, events, internal committees, membership services, and special projects on behalf of the association and its members./n/n /n/nABOUT US/n/nThe Ontario Waste Management Association (OWMA), founded in 1977, is the voice of the waste, recycling, and resource recovery sector in Ontario. It is a consistent and reliable source of information and solutions for government; and a leader in driving ethical, accountable, competitive, safe, and professional services to the public that support the shift towards a circular economy and ensure the protection of our environment. The association is a fast-paced, multiple project work environment in a small office context. Teamwork and a focus on outcomes are critical in meeting the goals of both the association and its membership./n/n/n/nROLES AND RESPONSIBILITIES/n/nAdministrative/n/nProvide ongoing support for association programs and member service activities./nProvide reception services, including managing incoming calls and emails and welcoming clients and guests./nProvide administrative and organizational support to staff and prepare specific correspondence and documents./nManage incoming and outgoing mail and deliveries./nEvent Coordination/n/nAssist in the planning and coordination of association events, meetings, and projects, including the Annual Meeting, educational programs, webinars, and seminars./nConduct ongoing outreach by email and phone to members and association partners to support ongoing event activities./nMarketing and Communications/n/nAssist with the production and distribution of external and internal presentations, communications, newsletters, and reports./nAssist with the development and implementation of the association’s annual Member and Services Guide, including collection of ads, content updates, supplier management, etc./nTechnology/n/nMaintain and update the OWMA’s server, databases, and IT equipment as required./nMaintain the information and content of OWMA’s website./nMaintain a filing system for electronic and hard copies of all correspondence and documents./nCustomer Service/n/nProject a professional image and maintain personal and cordial relationships with members, external stakeholders, and the public./nMaintain professional attitude and solution-based approach./nOther/n/nMaintain the master association calendar of activities and schedule for association meetings./nCoordinate office boardroom schedule. Maintain an inventory of office supplies, prepare supplies orders, source vendors, and negotiate pricing./nPerform additional duties and related functions as required and directed by the Director of Finance and Membership Services./nAdditional Information/n/nThis is a full-time position offering a competitive combination of salary, benefits, and pension./nThe office location is located at 170 Attwell Drive, Suite 580, Etobicoke, Ontario./nFor more information about OWMA, please visit www.owma.org. /n","jobField":"Customer Service, Information Technology, Marketing, Event Coordination, Administration","title":"Office Administrator","uuid":"e51be66b-46a9-4694-93c0-42e2dea90033","qualifications":"","demoSourceID":"1952924142","location":"Etobicoke","crossPlatformDuplicates":[],"jobType":"FULL_TIME"}